import { Test1 } from './usecase/Test1';

// -----------------------------------------------------------------------------
// イベント
// -----------------------------------------------------------------------------
// GAS で登録したい関数を global オブジェクトのプロパティに代入する。
declare const global: {
  [x: string]: Function;
};

/**
 * スプレッドシートを開いたときに実行するイベントハンドラ
 */
global.onOpen = (): void => {
  const ui = SpreadsheetApp.getUi();
  ui.createMenu('<<カスタム>>')
    .addItem('テスト1', 'test1')
    .addItem('テスト2', 'test1')
    .addToUi();
};

// -----------------------------------------------------------------------------
// メソッド
// -----------------------------------------------------------------------------
/**
 * テスト1
 */
global.test1 = (): void => {
  const test1 = new Test1();
  test1.execute();
  Browser.msgBox('テスト1完了');
};
